Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
        }
    }
}

/*Data_Process module*/

void pattern_out_done_handler(uint32_t out_gen_state)
{
    log_printf("OUT_GEN_STATE : %02x\n", out_gen_state);
    bool out_pattern[OUT_GEN_MAX_NUM_OUT][OUT_GEN_MAX_TRANSITIONS] ;

    switch((cam_trig_state_t)out_gen_state)
    {
        case IDLE:
        {
            if(false == (config.config_sensepi->trig_conf == TIMER_ONLY))
            {
                pir_enable();
                if(pir_oper_flag == true)
                {
                    pir_oper_flag = false;
                }
            }
            break;
        }
        case PHOTO:
        {
            out_gen_config_t idle_out_gen_config =
            {
                .num_transitions = 2,
                .out_gen_done_handler = pattern_out_done_handler,
                .out_gen_state = IDLE,
                .transitions_durations = {LFCLK_TICKS_977(10), time_remain},
                .next_out = {{1,1,1},
                {1,1,1}},
            };

#if DEBUG_PRINT
            log_printf("Out Pattern :\n");
            for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
            {
                for(uint32_t arr_p = 0;
                        arr_p<ARRAY_SIZE(idle_out_gen_config.next_out[0]); arr_p++)
                {
                    log_printf("%x ", idle_out_gen_config.next_out[row][arr_p]);
                }
                log_printf("\n");
            }
            log_printf("\n");
#endif
            out_gen_start(&idle_out_gen_config);
            break;
        }
        case VIDEO_START:
        {
            video_on_flag = true;
            pir_enable();
            out_gen_config_t video_end_out_gen_config = 
            {
                .num_transitions = 2,
                .out_gen_done_handler = pattern_out_done_handler,
                .out_gen_state = VIDEO_END,
                .transitions_durations =
                    {time_remain, VIDEO_CONTROL_PULSE},
                .next_out = 
                    {{1,0,1},
            {1,1,1}},
            };
            out_gen_start(&video_end_out_gen_config);
#if DEBUG_PRINT
            log_printf("Out Pattern :\n");
            for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
            {
                for(uint32_t arr_p = 0; arr_p<ARRAY_SIZE(out_pattern[0]); arr_p++)
                {
                    log_printf("%x ", video_end_out_gen_config.next_out[row][arr_p]);
                }
                log_printf("\n");
            }
            log_printf("\n");
#endif
            break;
        }
        case VIDEO_EXT:
        {
//            time_remain += LFCLK_TICKS_MS(video_ext_time);
            out_gen_config_t video_end_out_gen_config = 
            {
                .num_transitions = 2,
                .out_gen_done_handler = pattern_out_done_handler,
                .out_gen_state = VIDEO_END,
                .transitions_durations = {time_remain,
                     VIDEO_CONTROL_PULSE},
                .next_out = 
                {{1,0,1},
                    {1,1,1}},
            };
            out_gen_start(&video_end_out_gen_config);
            pir_enable();
#if DEBUG_PRINT
            log_printf("Out Pattern :\n");
            for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
            {
                for(uint32_t arr_p = 0; arr_p<OUT_GEN_MAX_TRANSITIONS; arr_p++)
                {
                    log_printf("%x ", video_end_out_gen_config.next_out[row][arr_p]);
                }
                log_printf("\n");
            }
            log_printf("\n");
#endif
            break;
        }
        case VIDEO_END:
        {
            video_on_flag = 0;
            pir_enable();
            break;
        }
        case VIDEO_TIMER:
        {
            break;
        }
    }
    return;
}

sensepi_config_t * sensepi_cam_trigger_get_sensepi_config_t()
{
    log_printf("SensePi_PIR_get_config\n");
    return (config.config_sensepi);
}

uint32_t data_process_get_video_extention (void)
{
    return (uint32_t)config.config_sensepi->pir_conf.intr_trig_timer * 100;
}

void single_shot_mode()
{
    log_printf("SINGLE_SHOT_MODE\n");
    uint32_t number_of_transition = SINGLE_SHOT_TRANSITIONS;

    time_remain = LFCLK_TICKS_MS(intr_trig_time_in) - (SINGLE_SHOT_DURATION);

    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = IDLE,
        .transitions_durations = { SINGLE_SHOT_DURATION, time_remain },
        .next_out = {{0, 1, 1},
                     {0, 1, 1}},
    };

#if DEBUG_PRINT
    log_printf("Out Pattern :\n");
    for(uint32_t row = 0; row< NUM_PIN_OUT; row++)
    {
        for(uint32_t arr_p = 0; 
                arr_p<ARRAY_SIZE(out_gen_config.next_out[0]); arr_p++)
        {
            log_printf("%x ", out_gen_config.next_out[row][arr_p]);
        }
        log_printf("\n");
    }
    log_printf("\n");
    log_printf("Time_remain : %d\n", time_remain);
#endif
    out_gen_start(&out_gen_config);  
}

void multi_shot_mode(uint32_t burst_duration, uint32_t burst_num)
{
    uint32_t number_of_transition = SINGLE_SHOT_TRANSITIONS * burst_num;
    log_printf("MULTISHOT MODE\n");
    //Time for trigger pulse and time till next trigger for each burst
    uint32_t repeat_delay_array[SINGLE_SHOT_TRANSITIONS] = {SINGLE_SHOT_DURATION,
            LFCLK_TICKS_MS(burst_duration * 100) - SINGLE_SHOT_DURATION};
    out_gen_config_t out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .out_gen_done_handler = pattern_out_done_handler,
        .out_gen_state = IDLE,
    };

    for(uint32_t i = 0; i< burst_num; i++)
    {
        memcpy(out_gen_config.transitions_durations + i*SINGLE_SHOT_TRANSITIONS,
                repeat_delay_array, SINGLE_SHOT_TRANSITIONS*sizeof(uint32_t));

        for(uint32_t j = 0; j < NUM_PIN_OUT; j++)
        {
            memcpy(*(out_gen_config.next_out +j),*(multishot_generic + j),
                    burst_num* SINGLE_SHOT_TRANSITIONS*sizeof(bool));
            //An extra '1' at the end for the remaining of the inter trigger time
            out_gen_config.next_out[j][burst_num* SINGLE_SHOT_TRANSITIONS] = 1;
        }
    }

